Catalogs/стомВидыСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВидыСегментов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Декоративный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветHex</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВидыСегментов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СегментОбъект = РеквизитФормыВЗначение("Объект");
	ЦветПоУмолчанию = СегментОбъект.Цвет.Получить();
	Если ТипЗнч(ЦветПоУмолчанию) <> Тип("Цвет") И ЗначениеЗаполнено(Объект.ЦветHex) Тогда
		ЦветПоУмолчанию = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветИзHex(Объект.ЦветHex);
	КонецЕсли;
	Цвет = ЦветПоУмолчанию;
	
	HTML = ПараметрыСеанса.стомКешированныеДанныеЗК.ПриложениеHTML;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	Объект.ЦветHex = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветВHex(Цвет);
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическиеПараметрыПриИзменении(Элемент)
	
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьСегментВПриложении()
	
	стомКомпонентыКлиент.ЗагрузитьЗубнуюКартуВПриложении(Элементы.HTML, ПолучитьСтруктуруИнициализации());

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруИнициализации()
	
	СтруктураJSON = Новый Структура("width, height, elements, selectWithCTRL", 500, 500, Новый Массив, Ложь);
	
	// Зуб
	СтруктураЗубJSON = Новый Структура("operation, id, width, height, elements", 
			"+", Строка(Новый УникальныйИдентификатор), 500, 500, Новый Массив);
	СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
	
	// Сегмент
	ПараметрыРасположения = Новый Структура("x, y, sX, sY, r", Объект.TranslateX, Объект.TranslateY, Объект.ScaleX, Объект.ScaleY, Объект.Rotation);
	СтруктураФигура = Новый Структура("silverlight, fill", Объект.Фигура, "#" + НРег(Прав(Объект.ЦветHex, 6)));
	СтруктураСегментJSON = Новый Структура("operation, id, transform, shape, isDecoration", 
		"+", Строка(Новый УникальныйИдентификатор), ПараметрыРасположения, СтруктураФигура, Объект.Декоративный);
	СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
			
	Возврат СтруктураJSON;
	
КонецФункции

#КонецОбласти
